// ---------------------------------------------------------------------------------------------------------------
// Тут зібрані підключення усіх джаваскрипт компонентів, які можуть знадобитись в роботі. Приклад використання зазвичай знаходиться в самому скрипті компоненту.
// ---------------------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------------------

// Підключення відстеження елементів для анімації. Інструкція знаходиться тут --> ./js_components/elementWatcher.js
// import { initializeElementWatcher } from './js_components/elementWatcher.js';
// Ініціалізація відстеження елементів для анімації.
// initializeElementWatcher();

// ---------------------------------------------------------------------------------------------------------------
// тут усе має бути типу через імпорти з описом і тд